БухЭксп/Documents/CW_СписаниеЗатратНаРеализацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_СписаниеЗатратНаРеализацию</Name>
			<BasedOn>
				<xr:Item>Document.CW_ДоходыПоГрузоперевозке</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_НезавершенноеПроизводство</xr:Item>
				<xr:Item>AccumulationRegister.CW_РасходыНаРеализацию</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриложениеКДоговору</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасходов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОтражения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыУчетаНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_Валюта</Name>
							<Comment>"Сумма" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС_Валюта</Name>
							<Comment>"НДС" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего_Валюта</Name>
							<Comment>"Всего" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_РасходыПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_РасходыПоГрузоперевозкам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>"Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>"НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма_Валюта</Name>
					<Comment>"Сумма" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_Валюта</Name>
					<Comment>"НДС" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПК_Всего</Name>
					<Comment>Результат корректировки: "Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_Сумма</Name>
					<Comment>Результат корректировки: "Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_НДС</Name>
					<Comment>Результат корректировки: "НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговоруПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрочиеРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлановыеСтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СоставГруппУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СоставГруппУслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Documents/CW_СписаниеЗатратНаРеализацию/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда 
		
		ДанныеОснования = ДанныеЗаполнения;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ДокументОснование") Тогда 
		
		ДанныеОснования = ДанныеЗаполнения.ДокументОснование;
		
	КонецЕсли; 
	
	Если ДанныеОснования <> Неопределено Тогда
		
		Дата			  			= ДанныеОснования.Дата;
		Организация       			= ДанныеОснования.Организация;
		ДокументОснование 			= ДанныеОснования;
		ПодразделениеОрганизации 	= ДанныеОснования.ПодразделениеОрганизации;
		
		РезультатЗапроса = ПолучитьДанныеДляЗаполненияТабличнойЧасти(ДанныеОснования);
		Затраты.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ПолучитьИзРасходовПоГрузоперевозке(Движение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(CW_РасходыПоГрузоперевозкам.Всего) КАК Всего,
		|	СУММА(CW_РасходыПоГрузоперевозкам.Количество) КАК Количество,
		|	СУММА(CW_РасходыПоГрузоперевозкам.Сумма) КАК Сумма,
		|	СУММА(CW_РасходыПоГрузоперевозкам.НДС) КАК НДС
		|ИЗ
		|	РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
		|ГДЕ
		|	CW_РасходыПоГрузоперевозкам.Грузоперевозка = &Грузоперевозка
		|	И CW_РасходыПоГрузоперевозкам.Контрагент = &Контрагент
		|	И CW_РасходыПоГрузоперевозкам.Договор = &Договор
		|	И CW_РасходыПоГрузоперевозкам.ПриложениеКДоговору = &ПриложениеКДоговору
		|	И CW_РасходыПоГрузоперевозкам.ДокументРасходов = &ДокументРасходов
		|	И CW_РасходыПоГрузоперевозкам.ПорядокОтражения = &ПорядокОтражения
		|	И CW_РасходыПоГрузоперевозкам.СтавкаНДС = &СтавкаНДС
		|	И CW_РасходыПоГрузоперевозкам.Номенклатура = &Номенклатура
		|	И CW_РасходыПоГрузоперевозкам.СтатьяЗатрат = &СтатьяЗатрат
		|	И CW_РасходыПоГрузоперевозкам.Подразделение = &Подразделение
		|	И CW_РасходыПоГрузоперевозкам.Валюта = &Валюта
		|	И CW_РасходыПоГрузоперевозкам.Покупатель = &Покупатель
		|	И CW_РасходыПоГрузоперевозкам.ДоговорПокупателя = &ДоговорПокупателя
		|	И CW_РасходыПоГрузоперевозкам.ПриложениеКДоговоруПокупателя = &ПриложениеКДоговоруПокупателя";
	
	Запрос.УстановитьПараметр("Валюта",							Движение.Валюта);
	Запрос.УстановитьПараметр("Грузоперевозка",					Движение.Грузоперевозка);
	Запрос.УстановитьПараметр("Договор",						Движение.Договор);
	Запрос.УстановитьПараметр("ДоговорПокупателя",				Движение.ДоговорПокупателя);
	Запрос.УстановитьПараметр("ДокументРасходов",				Движение.ДокументРасходов);
	Запрос.УстановитьПараметр("Контрагент",						Движение.Контрагент);
	Запрос.УстановитьПараметр("Номенклатура",					Движение.Номенклатура);
	Запрос.УстановитьПараметр("Подразделение",					Движение.Подразделение);
	Запрос.УстановитьПараметр("Покупатель",						Движение.Покупатель);
	Запрос.УстановитьПараметр("ПорядокОтражения",				Движение.ПорядокОтражения);
	Запрос.УстановитьПараметр("ПриложениеКДоговору",			Движение.ПриложениеКДоговору);
	Запрос.УстановитьПараметр("ПриложениеКДоговоруПокупателя",	Движение.ПриложениеКДоговоруПокупателя);
	Запрос.УстановитьПараметр("СтавкаНДС",						Движение.СтавкаНДС);
	Запрос.УстановитьПараметр("СтатьяЗатрат",					Движение.СтатьяЗатрат);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда  
		
		// Если списание выполняется по корректировочным документам, 
		// то в движениях количество может быть равным нулю. В этом случае
		// коэффициент всегда принимаем равным единице, т.е. списываем рубли 
		// в том значении в котором они были отражены в движениях 
		// корректировочного документа "Расходы по грузоперевозке" 
		Если Движение.Количество = 0 Тогда
			Коэффициент = 1;
		Иначе
			Коэффициент = Движение.Количество / ?(Выборка.Количество=0,1,Выборка.Количество);
		КонецЕсли;   
		
		Движение.Сумма	= Окр(Выборка.Сумма * Коэффициент, 2);
		Движение.НДС	= Окр(Выборка.НДС 	* Коэффициент, 2);
		Движение.Всего	= Окр(Выборка.Всего	* Коэффициент, 2);
		
	КонецЕсли;	

КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.CW_НезавершенноеПроизводство.Записывать 	= Истина;

	Движения.CW_НезавершенноеПроизводство.Очистить();
	Движения.CW_РасходыНаРеализацию.Очистить();


	//CW_НезавершенноеПроизводство
	РезультатЗапроса =  ПолучитьДанныеДляНезавершенногоПроизводства();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		Движение = Движения.CW_НезавершенноеПроизводство.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);

		Коэффициент 	= Выборка.Количество / ?(Выборка.КоличествоОстаток=0,1,Выборка.КоличествоОстаток);
		Движение.Сумма	= Окр(Выборка.СуммаОстаток 	* Коэффициент, 2);
		Движение.НДС	= Окр(Выборка.НДСОстаток 	* Коэффициент, 2);
		Движение.Всего	= Окр(Выборка.ВсегоОстаток	* Коэффициент, 2);
		
		// выполняем проверку, если валютные суммы не равны нулю, а рублевые суммы равны нулю, 
		// то рублевый эквивалент расходов получим из регистра "CW_РасходыПОгрузоперевозке"
		// Такая ситуация может возникать когда делается попытка списать расходы на реализацию раньше, 
		// чем были получены эти расходы (подход допустим в целях управленческого учета). 
		Если НЕ Движение.Сумма И Движение.Сумма_Валюта
			ИЛИ НЕ Движение.НДС И Движение.НДС_Валюта
			ИЛИ НЕ Движение.Всего И Движение.Сумма_Валюта Тогда
			Если Движение.Валюта = Константы.ВалютаРегламентированногоУчета.Получить()Тогда
				Движение.Количество	= Выборка.Количество;		
				Движение.Сумма		= Выборка.Сумма_Валюта;		
				Движение.НДС		= Выборка.НДС_Валюта;		
				Движение.Всего		= Выборка.Всего_Валюта;		
			Иначе
				ПолучитьИзРасходовПоГрузоперевозке(Движение);
			КонецЕсли;	
		КонецЕсли;
		
		
	КонецЦикла;
	//CW_НезавершенноеПроизводство

	Движения.Записать();

	//Проверка остатков после записи
	РезультатЗапроса =  ПолучитьДанныеДляКонтроля();
	ВыборкаДокументы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументы.Следующий() Цикл

		МассивОстатки = новый Массив;
		Если ВыборкаДокументы.Сумма_ВалютаОстаток < 0 Тогда
			МассивОстатки.Добавить("Сумма: " +Формат(ВыборкаДокументы.Сумма_ВалютаОстаток, "ЧДЦ=2"));
		КонецЕсли;
		Если ВыборкаДокументы.НДС_ВалютаОстаток < 0 Тогда
			МассивОстатки.Добавить("НДС: " +Формат(ВыборкаДокументы.НДС_ВалютаОстаток, "ЧДЦ=2"));
		КонецЕсли;
		Если ВыборкаДокументы.Всего_ВалютаОстаток < 0 Тогда
			МассивОстатки.Добавить("Всего: " +Формат(ВыборкаДокументы.Всего_ВалютаОстаток, "ЧДЦ=2"));
		КонецЕсли;

		СтрокаОстаток = СтрСоединить(МассивОстатки, "; ");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По документу расходов "+СокрЛП(ВыборкаДокументы.ДокументРасходов) + " остаток НЗП в валюте меньше 0 ("+СтрокаОстаток+")"); 
		Выборка = ВыборкаДокументы.Выбрать();
		Пока Выборка.Следующий() Цикл

			МассивОстатки = новый Массив;
			Если Выборка.Сумма_ВалютаОстаток < 0 Тогда
				МассивОстатки.Добавить("Сумма: " +Формат(Выборка.Сумма_ВалютаОстаток, "ЧДЦ=2"));
			КонецЕсли;
			Если Выборка.НДС_ВалютаОстаток < 0 Тогда
				МассивОстатки.Добавить("НДС: " +Формат(Выборка.НДС_ВалютаОстаток, "ЧДЦ=2"));
			КонецЕсли;
			Если Выборка.Всего_ВалютаОстаток < 0 Тогда
				МассивОстатки.Добавить("Всего: " +Формат(Выборка.Всего_ВалютаОстаток, "ЧДЦ=2"));
			КонецЕсли;

			СтрокаОстаток = СтрСоединить(МассивОстатки, "; ");

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(" - "+СокрЛП(Выборка.Грузоперевозка) + " остаток "+СтрокаОстаток); 
		КонецЦикла;
	КонецЦикла;
	//Проверка остатков после записи

	//CW_РасходыНаРеализацию
	Движения.CW_РасходыНаРеализацию.Записывать = Истина;

	РезультатЗапроса = ПолучитьДанныеДляРасхдовНаРеализацию();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.CW_РасходыНаРеализацию.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.ДокументДоходов = ДокументОснование;
	КонецЦикла;
	//CW_РасходыНаРеализацию
	
КонецПроцедуры

Функция ПолучитьДанныеДляРасхдовНаРеализацию()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НезавершенноеПроизводство.Период КАК Период,
	               |	CW_НезавершенноеПроизводство.Организация КАК Организация,
	               |	CW_НезавершенноеПроизводство.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	               |	CW_НезавершенноеПроизводство.Грузоперевозка КАК Грузоперевозка,
	               |	CW_НезавершенноеПроизводство.Контрагент КАК Контрагент,
	               |	CW_НезавершенноеПроизводство.Договор КАК Договор,
	               |	CW_НезавершенноеПроизводство.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	CW_НезавершенноеПроизводство.ДокументРасходов КАК ДокументРасходов,
	               |	CW_НезавершенноеПроизводство.ПорядокОтражения КАК ПорядокОтражения,
	               |	CW_НезавершенноеПроизводство.СтавкаНДС КАК СтавкаНДС,
	               |	CW_НезавершенноеПроизводство.СпособУчетаНДС КАК СпособУчетаНДС,
	               |	CW_НезавершенноеПроизводство.Номенклатура КАК Номенклатура,
	               |	CW_НезавершенноеПроизводство.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	CW_НезавершенноеПроизводство.Подразделение КАК Подразделение,
	               |	CW_НезавершенноеПроизводство.Валюта КАК Валюта,
	               |	CW_НезавершенноеПроизводство.Покупатель КАК Покупатель,
	               |	CW_НезавершенноеПроизводство.ДоговорПокупателя КАК ДоговорПокупателя,
	               |	CW_НезавершенноеПроизводство.ПриложениеКДоговоруПокупателя КАК ПриложениеКДоговоруПокупателя,
	               |	CW_НезавершенноеПроизводство.Количество КАК Количество,
	               |	CW_НезавершенноеПроизводство.Сумма КАК Сумма,
	               |	CW_НезавершенноеПроизводство.НДС КАК НДС,
	               |	CW_НезавершенноеПроизводство.Всего КАК Всего,
	               |	CW_НезавершенноеПроизводство.Сумма_Валюта КАК Сумма_Валюта,
	               |	CW_НезавершенноеПроизводство.НДС_Валюта КАК НДС_Валюта,
	               |	CW_НезавершенноеПроизводство.Всего_Валюта КАК Всего_Валюта,
	               |	ЕСТЬNULL(СоставГруппУслугПоПриложению.ГруппаУслуг, ЕСТЬNULL(СоставГруппУслугПоДоговору.ГруппаУслуг, НЕОПРЕДЕЛЕНО)) КАК ГруппаУслуг
	               |ИЗ
	               |	РегистрНакопления.CW_НезавершенноеПроизводство КАК CW_НезавершенноеПроизводство
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СоставГруппУслуг КАК СоставГруппУслугПоДоговору
	               |		ПО CW_НезавершенноеПроизводство.ДоговорПокупателя = СоставГруппУслугПоДоговору.Владелец
	               |			И CW_НезавершенноеПроизводство.Номенклатура = СоставГруппУслугПоДоговору.Услуга
	               |			И (CW_НезавершенноеПроизводство.ДоговорПокупателя.ИспользуетсяОграниченияПоГруппамУслуг = ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СоставГруппУслуг КАК СоставГруппУслугПоПриложению
	               |		ПО CW_НезавершенноеПроизводство.ПриложениеКДоговоруПокупателя = СоставГруппУслугПоПриложению.Владелец
	               |			И CW_НезавершенноеПроизводство.Номенклатура = СоставГруппУслугПоПриложению.Услуга
	               |			И (CW_НезавершенноеПроизводство.ПриложениеКДоговоруПокупателя.ИспользуетсяОграниченияПоГруппамУслуг = ИСТИНА)
	               |ГДЕ
	               |	CW_НезавершенноеПроизводство.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Возврат Запрос.Выполнить();

КонецФункции

Функция ПолучитьДанныеДляНезавершенногоПроизводства()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка
	               |ПОМЕСТИТЬ ВТ_Грузоперевозки
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &ДокументОснование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка.Организация КАК Организация,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка КАК Ссылка,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка.Дата КАК Период,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка.ДокументОснование КАК ДокументДоходов,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.НомерСтроки КАК НомерСтроки,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Грузоперевозка КАК Грузоперевозка,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Контрагент КАК Контрагент,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Договор КАК Договор,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.ДокументРасходов КАК ДокументРасходов,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.ПорядокОтражения КАК ПорядокОтражения,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.СтавкаНДС КАК СтавкаНДС,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.СпособУчетаНДС КАК СпособУчетаНДС,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Номенклатура КАК Номенклатура,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Подразделение КАК Подразделение,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Валюта КАК Валюта,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Количество КАК Количество,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Сумма_Валюта КАК Сумма_Валюта,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.НДС_Валюта КАК НДС_Валюта,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Всего_Валюта КАК Всего_Валюта,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка.ДокументОснование.Контрагент КАК Покупатель,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка.ДокументОснование.Договор КАК ДоговорПокупателя,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка.ДокументОснование.ПриложениеКДоговору КАК ПриложениеКДоговоруПокупателя
	               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	               |ИЗ
	               |	Документ.CW_СписаниеЗатратНаРеализацию.Затраты КАК CW_СписаниеЗатратНаРеализациюЗатраты
	               |ГДЕ
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_НезавершенноеПроизводствоОстатки.Организация КАК Организация,
	               |	CW_НезавершенноеПроизводствоОстатки.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	               |	CW_НезавершенноеПроизводствоОстатки.Грузоперевозка КАК Грузоперевозка,
	               |	CW_НезавершенноеПроизводствоОстатки.Контрагент КАК Контрагент,
	               |	CW_НезавершенноеПроизводствоОстатки.Договор КАК Договор,
	               |	CW_НезавершенноеПроизводствоОстатки.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	CW_НезавершенноеПроизводствоОстатки.ДокументРасходов КАК ДокументРасходов,
	               |	CW_НезавершенноеПроизводствоОстатки.ПорядокОтражения КАК ПорядокОтражения,
	               |	CW_НезавершенноеПроизводствоОстатки.СтавкаНДС КАК СтавкаНДС,
	               |	CW_НезавершенноеПроизводствоОстатки.СпособУчетаНДС КАК СпособУчетаНДС,
	               |	CW_НезавершенноеПроизводствоОстатки.Номенклатура КАК Номенклатура,
	               |	CW_НезавершенноеПроизводствоОстатки.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	CW_НезавершенноеПроизводствоОстатки.Подразделение КАК Подразделение,
	               |	CW_НезавершенноеПроизводствоОстатки.Валюта КАК Валюта,
	               |	CW_НезавершенноеПроизводствоОстатки.Покупатель КАК Покупатель,
	               |	CW_НезавершенноеПроизводствоОстатки.ДоговорПокупателя КАК ДоговорПокупателя,
	               |	CW_НезавершенноеПроизводствоОстатки.ПриложениеКДоговоруПокупателя КАК ПриложениеКДоговоруПокупателя,
	               |	CW_НезавершенноеПроизводствоОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	CW_НезавершенноеПроизводствоОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	CW_НезавершенноеПроизводствоОстатки.НДСОстаток КАК НДСОстаток,
	               |	CW_НезавершенноеПроизводствоОстатки.ВсегоОстаток КАК ВсегоОстаток
	               |ПОМЕСТИТЬ ВТ_Остатки
	               |ИЗ
	               |	РегистрНакопления.CW_НезавершенноеПроизводство.Остатки(
	               |			&ДатаСреза,
	               |			Грузоперевозка В
	               |				(ВЫБРАТЬ
	               |					ВТ_Грузоперевозки.Грузоперевозка КАК Грузоперевозка
	               |				ИЗ
	               |					ВТ_Грузоперевозки КАК ВТ_Грузоперевозки)) КАК CW_НезавершенноеПроизводствоОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Организация КАК Организация,
	               |	ВТ_ДанныеДокумента.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	               |	ВТ_ДанныеДокумента.Ссылка КАК Ссылка,
	               |	ВТ_ДанныеДокумента.Период КАК Период,
	               |	ВТ_ДанныеДокумента.ДокументДоходов КАК ДокументДоходов,
	               |	ВТ_ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	               |	ВТ_ДанныеДокумента.Грузоперевозка КАК Грузоперевозка,
	               |	ВТ_ДанныеДокумента.Контрагент КАК Контрагент,
	               |	ВТ_ДанныеДокумента.Договор КАК Договор,
	               |	ВТ_ДанныеДокумента.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	ВТ_ДанныеДокумента.ДокументРасходов КАК ДокументРасходов,
	               |	ВТ_ДанныеДокумента.ПорядокОтражения КАК ПорядокОтражения,
	               |	ВТ_ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	               |	ВТ_ДанныеДокумента.СпособУчетаНДС КАК СпособУчетаНДС,
	               |	ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура,
	               |	ВТ_ДанныеДокумента.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	ВТ_ДанныеДокумента.Подразделение КАК Подразделение,
	               |	ВТ_ДанныеДокумента.Валюта КАК Валюта,
	               |	ВТ_ДанныеДокумента.Покупатель КАК Покупатель,
	               |	ВТ_ДанныеДокумента.ДоговорПокупателя КАК ДоговорПокупателя,
	               |	ВТ_ДанныеДокумента.ПриложениеКДоговоруПокупателя КАК ПриложениеКДоговоруПокупателя,
	               |	ВТ_ДанныеДокумента.Количество КАК Количество,
	               |	ВТ_ДанныеДокумента.Сумма_Валюта КАК Сумма_Валюта,
	               |	ВТ_ДанныеДокумента.НДС_Валюта КАК НДС_Валюта,
	               |	ВТ_ДанныеДокумента.Всего_Валюта КАК Всего_Валюта,
	               |	ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ЕСТЬNULL(ВТ_Остатки.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ЕСТЬNULL(ВТ_Остатки.НДСОстаток, 0) КАК НДСОстаток,
	               |	ЕСТЬNULL(ВТ_Остатки.ВсегоОстаток, 0) КАК ВсегоОстаток
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	               |		ПО ВТ_ДанныеДокумента.Организация = ВТ_Остатки.Организация
	               |			И ВТ_ДанныеДокумента.ПодразделениеОрганизации = ВТ_Остатки.ПодразделениеОрганизации
	               |			И ВТ_ДанныеДокумента.Грузоперевозка = ВТ_Остатки.Грузоперевозка
	               |			И ВТ_ДанныеДокумента.Контрагент = ВТ_Остатки.Контрагент
	               |			И ВТ_ДанныеДокумента.Договор = ВТ_Остатки.Договор
	               |			И ВТ_ДанныеДокумента.ПриложениеКДоговору = ВТ_Остатки.ПриложениеКДоговору
	               |			И ВТ_ДанныеДокумента.ДокументРасходов = ВТ_Остатки.ДокументРасходов
	               |			И ВТ_ДанныеДокумента.ПорядокОтражения = ВТ_Остатки.ПорядокОтражения
	               |			И ВТ_ДанныеДокумента.СтавкаНДС = ВТ_Остатки.СтавкаНДС
	               |			И ВТ_ДанныеДокумента.СпособУчетаНДС = ВТ_Остатки.СпособУчетаНДС
	               |			И ВТ_ДанныеДокумента.Номенклатура = ВТ_Остатки.Номенклатура
	               |			И ВТ_ДанныеДокумента.СтатьяЗатрат = ВТ_Остатки.СтатьяЗатрат
	               |			И ВТ_ДанныеДокумента.Подразделение = ВТ_Остатки.Подразделение
	               |			И ВТ_ДанныеДокумента.Валюта = ВТ_Остатки.Валюта
	               |			И ВТ_ДанныеДокумента.Покупатель = ВТ_Остатки.Покупатель
	               |			И ВТ_ДанныеДокумента.ДоговорПокупателя = ВТ_Остатки.ДоговорПокупателя
	               |			И ВТ_ДанныеДокумента.ПриложениеКДоговоруПокупателя = ВТ_Остатки.ПриложениеКДоговоруПокупателя";
	
	Запрос.УстановитьПараметр("ДатаСреза", 			Новый Граница(Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("ДокументОснование", 	ДокументОснование);
	
	Возврат Запрос.Выполнить();

КонецФункции

Функция ПолучитьДанныеДляКонтроля()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка
	               |ПОМЕСТИТЬ ВТ_Грузоперевозки
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &ДокументОснование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка.Организация КАК Организация,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка КАК Ссылка,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка.Дата КАК Период,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка.ДокументОснование КАК ДокументДоходов,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.НомерСтроки КАК НомерСтроки,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Грузоперевозка КАК Грузоперевозка,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Контрагент КАК Контрагент,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Договор КАК Договор,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.ДокументРасходов КАК ДокументРасходов,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.ПорядокОтражения КАК ПорядокОтражения,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.СтавкаНДС КАК СтавкаНДС,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.СпособУчетаНДС КАК СпособУчетаНДС,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Номенклатура КАК Номенклатура,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Подразделение КАК Подразделение,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Валюта КАК Валюта,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Количество КАК Количество,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Сумма_Валюта КАК Сумма_Валюта,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.НДС_Валюта КАК НДС_Валюта,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Всего_Валюта КАК Всего_Валюта,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка.ДокументОснование.Контрагент КАК Покупатель,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка.ДокументОснование.Договор КАК ДоговорПокупателя,
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка.ДокументОснование.ПриложениеКДоговору КАК ПриложениеКДоговоруПокупателя
	               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	               |ИЗ
	               |	Документ.CW_СписаниеЗатратНаРеализацию.Затраты КАК CW_СписаниеЗатратНаРеализациюЗатраты
	               |ГДЕ
	               |	CW_СписаниеЗатратНаРеализациюЗатраты.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_НезавершенноеПроизводствоОстатки.Организация КАК Организация,
	               |	CW_НезавершенноеПроизводствоОстатки.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	               |	CW_НезавершенноеПроизводствоОстатки.Грузоперевозка КАК Грузоперевозка,
	               |	CW_НезавершенноеПроизводствоОстатки.Контрагент КАК Контрагент,
	               |	CW_НезавершенноеПроизводствоОстатки.Договор КАК Договор,
	               |	CW_НезавершенноеПроизводствоОстатки.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	CW_НезавершенноеПроизводствоОстатки.ДокументРасходов КАК ДокументРасходов,
	               |	CW_НезавершенноеПроизводствоОстатки.ПорядокОтражения КАК ПорядокОтражения,
	               |	CW_НезавершенноеПроизводствоОстатки.СтавкаНДС КАК СтавкаНДС,
	               |	CW_НезавершенноеПроизводствоОстатки.СпособУчетаНДС КАК СпособУчетаНДС,
	               |	CW_НезавершенноеПроизводствоОстатки.Номенклатура КАК Номенклатура,
	               |	CW_НезавершенноеПроизводствоОстатки.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	CW_НезавершенноеПроизводствоОстатки.Подразделение КАК Подразделение,
	               |	CW_НезавершенноеПроизводствоОстатки.Валюта КАК Валюта,
	               |	CW_НезавершенноеПроизводствоОстатки.Покупатель КАК Покупатель,
	               |	CW_НезавершенноеПроизводствоОстатки.ДоговорПокупателя КАК ДоговорПокупателя,
	               |	CW_НезавершенноеПроизводствоОстатки.ПриложениеКДоговоруПокупателя КАК ПриложениеКДоговоруПокупателя,
	               |	CW_НезавершенноеПроизводствоОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	CW_НезавершенноеПроизводствоОстатки.Сумма_ВалютаОстаток КАК Сумма_ВалютаОстаток,
	               |	CW_НезавершенноеПроизводствоОстатки.НДС_ВалютаОстаток КАК НДС_ВалютаОстаток,
	               |	CW_НезавершенноеПроизводствоОстатки.Всего_ВалютаОстаток КАК Всего_ВалютаОстаток
	               |ПОМЕСТИТЬ ВТ_Остатки
	               |ИЗ
	               |	РегистрНакопления.CW_НезавершенноеПроизводство.Остатки(
	               |			&ДатаСреза,
	               |			Грузоперевозка В
	               |				(ВЫБРАТЬ
	               |					ВТ_Грузоперевозки.Грузоперевозка КАК Грузоперевозка
	               |				ИЗ
	               |					ВТ_Грузоперевозки КАК ВТ_Грузоперевозки)) КАК CW_НезавершенноеПроизводствоОстатки
	               |ГДЕ
	               |	(CW_НезавершенноеПроизводствоОстатки.Всего_ВалютаОстаток < 0
	               |			ИЛИ CW_НезавершенноеПроизводствоОстатки.Сумма_ВалютаОстаток < 0
	               |			ИЛИ CW_НезавершенноеПроизводствоОстатки.НДС_ВалютаОстаток < 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.ДокументРасходов КАК ДокументРасходов,
	               |	ВТ_ДанныеДокумента.Грузоперевозка КАК Грузоперевозка,
	               |	ЕСТЬNULL(ВТ_Остатки.Сумма_ВалютаОстаток, 0) КАК Сумма_ВалютаОстаток,
	               |	ЕСТЬNULL(ВТ_Остатки.НДС_ВалютаОстаток, 0) КАК НДС_ВалютаОстаток,
	               |	ЕСТЬNULL(ВТ_Остатки.Всего_ВалютаОстаток, 0) КАК Всего_ВалютаОстаток
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	               |		ПО ВТ_ДанныеДокумента.Организация = ВТ_Остатки.Организация
	               |			И ВТ_ДанныеДокумента.ПодразделениеОрганизации = ВТ_Остатки.ПодразделениеОрганизации
	               |			И ВТ_ДанныеДокумента.Грузоперевозка = ВТ_Остатки.Грузоперевозка
	               |			И ВТ_ДанныеДокумента.Контрагент = ВТ_Остатки.Контрагент
	               |			И ВТ_ДанныеДокумента.Договор = ВТ_Остатки.Договор
	               |			И ВТ_ДанныеДокумента.ПриложениеКДоговору = ВТ_Остатки.ПриложениеКДоговору
	               |			И ВТ_ДанныеДокумента.ДокументРасходов = ВТ_Остатки.ДокументРасходов
	               |			И ВТ_ДанныеДокумента.ПорядокОтражения = ВТ_Остатки.ПорядокОтражения
	               |			И ВТ_ДанныеДокумента.СтавкаНДС = ВТ_Остатки.СтавкаНДС
	               |			И ВТ_ДанныеДокумента.СпособУчетаНДС = ВТ_Остатки.СпособУчетаНДС
	               |			И ВТ_ДанныеДокумента.Номенклатура = ВТ_Остатки.Номенклатура
	               |			И ВТ_ДанныеДокумента.СтатьяЗатрат = ВТ_Остатки.СтатьяЗатрат
	               |			И ВТ_ДанныеДокумента.Подразделение = ВТ_Остатки.Подразделение
	               |			И ВТ_ДанныеДокумента.Валюта = ВТ_Остатки.Валюта
	               |			И ВТ_ДанныеДокумента.Покупатель = ВТ_Остатки.Покупатель
	               |			И ВТ_ДанныеДокумента.ДоговорПокупателя = ВТ_Остатки.ДоговорПокупателя
	               |			И ВТ_ДанныеДокумента.ПриложениеКДоговоруПокупателя = ВТ_Остатки.ПриложениеКДоговоруПокупателя
	               |ИТОГИ
	               |	СУММА(Сумма_ВалютаОстаток),
	               |	СУММА(НДС_ВалютаОстаток),
	               |	СУММА(Всего_ВалютаОстаток)
	               |ПО
	               |	ДокументРасходов";
	
	Запрос.УстановитьПараметр("ДатаСреза", 			Новый Граница(Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("ДокументОснование", 	ДокументОснование);
	
	Возврат Запрос.Выполнить();

КонецФункции

Функция ПолучитьДанныеДляЗаполненияТабличнойЧасти(ДанныеЗаполнения, Знач РезультатПодбора = Неопределено) Экспорт
	
	//ВНИМАНИЕ! В ТЕКСТЕ ЗАПРОСА "//УсловиеКОРП"
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Если РезультатПодбора <> Неопределено Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	РезультатПодбора.ДокументРасходов КАК ДокументРасходов,
		|	РезультатПодбора.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_РезультатПодбора
		|ИЗ
		|	&РезультатПодбора КАК РезультатПодбора";
		
		Запрос.УстановитьПараметр("РезультатПодбора",		РезультатПодбора);
		Запрос.Выполнить();
		
	КонецЕсли;
	//Иначе
		
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка
	|ПОМЕСТИТЬ ВТ_Грузоперевозки
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения.Ссылка);
	Запрос.Выполнить();
	//КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_НезавершенноеПроизводствоОстатки.Грузоперевозка КАК Грузоперевозка,
	|	CW_НезавершенноеПроизводствоОстатки.Контрагент КАК Контрагент,
	|	CW_НезавершенноеПроизводствоОстатки.Договор КАК Договор,
	|	CW_НезавершенноеПроизводствоОстатки.ПриложениеКДоговору КАК ПриложениеКДоговору,
	|	CW_НезавершенноеПроизводствоОстатки.ДокументРасходов КАК ДокументРасходов,
	|	CW_НезавершенноеПроизводствоОстатки.ПорядокОтражения КАК ПорядокОтражения,
	|	CW_НезавершенноеПроизводствоОстатки.СтавкаНДС КАК СтавкаНДС,
	|	CW_НезавершенноеПроизводствоОстатки.СпособУчетаНДС КАК СпособУчетаНДС,
	|	CW_НезавершенноеПроизводствоОстатки.Номенклатура КАК Номенклатура,
	|	CW_НезавершенноеПроизводствоОстатки.СтатьяЗатрат КАК СтатьяЗатрат,
	|	CW_НезавершенноеПроизводствоОстатки.Подразделение КАК Подразделение,
	|	CW_НезавершенноеПроизводствоОстатки.Валюта КАК Валюта,
	|	CW_НезавершенноеПроизводствоОстатки.КоличествоОстаток КАК Количество,
	|	CW_НезавершенноеПроизводствоОстатки.Сумма_ВалютаОстаток КАК Сумма_Валюта,
	|	CW_НезавершенноеПроизводствоОстатки.НДС_ВалютаОстаток КАК НДС_Валюта,
	|	CW_НезавершенноеПроизводствоОстатки.Всего_ВалютаОстаток КАК Всего_Валюта
	|ИЗ
	|	РегистрНакопления.CW_НезавершенноеПроизводство.Остатки(
	|			&ДатаСреза,
	|			Организация = &Организация  
	|			И Грузоперевозка В
	|					(ВЫБРАТЬ
	|						ВТ_Грузоперевозки.Грузоперевозка КАК Грузоперевозка
	|					ИЗ
	|						ВТ_Грузоперевозки КАК ВТ_Грузоперевозки)	
	|			И Покупатель = &Покупатель
	|				И ДоговорПокупателя = &ДоговорПокупателя
	|				И ПриложениеКДоговоруПокупателя = &ПриложениеКДоговору
	|			//УсловиеКОРП
	|			//УсловияОстатков
	|				) КАК CW_НезавершенноеПроизводствоОстатки";
	
	//Для версии КОРП
	Если ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям") Тогда
		
		ПодразделениеОрганизации 	= ДанныеЗаполнения.ПодразделениеОрганизации;
		Запрос.Текст 				= СтрЗаменить(Запрос.Текст, "//УсловиеКОРП","И ПодразделениеОрганизации = &ПодразделениеОрганизации");
		Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);
		
	КонецЕсли;
	//Для версии КОРП
	
	Если РезультатПодбора <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловияОстатков",	
		"И (ДокументРасходов, Номенклатура) В
		|	(ВЫБРАТЬ
		|		ВТ_РезультатПодбора.ДокументРасходов КАК ДокументРасходов,
		|		ВТ_РезультатПодбора.Номенклатура КАК Номенклатура
		|	ИЗ
		|	    ВТ_РезультатПодбора КАК ВТ_РезультатПодбора)");
	КонецЕсли;

	Запрос.УстановитьПараметр("Покупатель",				ДанныеЗаполнения.Контрагент);
	Запрос.УстановитьПараметр("ДоговорПокупателя", 		ДанныеЗаполнения.Договор);
	Запрос.УстановитьПараметр("ПриложениеКДоговору",	ДанныеЗаполнения.ПриложениеКДоговору);
	
	ДатаСреза = ?(ДанныеЗаполнения.Дата = Дата(1,1,1), ТекущаяДата(), ДанныеЗаполнения.Дата);
	
	Запрос.УстановитьПараметр("ДатаСреза", 				ДатаСреза);
	Запрос.УстановитьПараметр("Организация",			ДанныеЗаполнения.Организация);

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции
